[
  {
    "subtitle": "Su di me!",
    "content": "Sono un <strong> Bioingegnere </strong>, ho conseguito il mio titolo presso l’<strong>Università degli Studi di Padova </strong> nel <strong> Dicembre 2019 </strong>. Imparo in fretta e sono sempre disposto ad imparare nuove tecnologie. Mi piace <strong> conoscere </strong> e <strong> studiare </strong> sempre nuovi linguaggi di programmazione e framework e mi impegno ogni giorno per diventare uno sviluppatore software migliore e il più completo possibile. Credo che uno dei miei valori sia l’abilità a risolvere problemi quindi sono sempre concentrato nello studio di algoritmi a prescindere dal linguaggio di programmazione utilizzato. In questo periodo lavoro ad un progetto Iot per l’Home Automation."
  },
  {
    "subtitle": "Esperienza!",
    "content": "Ho iniziato a lavorare come sviluppatore software da inizio 2020. Ho iniziato il mio lavoro studiando <strong> Amazon AWS </strong> con lo scopo di connettere i dispositivi prodotti dall’azienda per cui lavoravo ad un servizio Cloud privato. Dopo una iniziale fase di studio sono riuscito a connettere un dispositivo alla piattaforma AWS Iot Core in modo sicuro tramite protocollo <strong> MQTT </strong>. Ho avuto poi modo di implementare tutta la parte di gestione dei comandi in entrata ed uscita del dispositivo andando a modificare il firmware dello stesso. Il firmware è stato scritto in <strong> ANSI C </strong> su ambiente di sviluppo integrato <strong> Keil uVision IDE. </strong> A seguito della recente pandemia però il progetto Cloud è stato sospeso a tempo indefinito, quindi sono stato spostato in un altro progetto. Dopo questa esperienza sono passato ad un progetto che prevedeva lo sviluppo di un applicativo desktop con <strong> Visual Basic .NET </strong> per la gestione di  <strong> TAG NFC </strong>. Lo scopo di questi TAG NFC era quello di contenere dati relativi a prodotti gastronomici. L’applicativo scritto eseguiva la corretta configurazione del TAG, se necessaria, e forniva la possibilità di scrivere o cancellare dati nel rispetto del protocollo <strong> NDEF </strong>. In seguito è stata anche aggiunta la possibilità di proteggere la memoria mediante l’utilizzo di password. Questo lavoro è stato molto significativo per me in quanto ho avuto modo di ambientarmi in <strong> Microsoft Visual Studio </strong> e soprattutto perché è stato il mio primo lavoro che è poi entrato in produzione. In seguito mi è stato affidato il compito di sviluppare due siti Web, uno per uso interno e uno per una azienda cliente. Inizialmente ho iniziato a sviluppare i due siti in <strong> HTML </strong>, <strong> CSS </strong> e <strong> PHP </strong> ma il risultato ottenuto non mi soddisfaceva. Complice la mancanza di altre mansioni da svolgere, ho preso l’iniziativa di riscrivere entrambi i siti da zero utilizzando tecnologie più recenti ed evolute ma soprattutto che mi permettessero di ottenere dei risultati migliori. Ho quindi iniziato ad utilizzare anche <strong> Bootstrap </strong>, <strong> Javascript </strong> e  <strong> jQuery </strong>. Queste tecnologie mi hanno infatti permesso di ottenere risultati molto migliori con uno sforzo minore. Entrambi i siti sono infatti SPA (Single Page Application) e Responsive. Lo scopo del sito ad utilizzo interno era la gestione della qualità dell’azienda, mentre lo scopo del secondo sito era fornire una piattaforma di gestione dei firmware per due delle principali macchine prodotte dall’azienda per cui ero impiegato. L’ultima attività a cui ho preso parte è stata la manutenzione di una vetusta App Android scritta in <strong> Java </strong>. La funzione dell’App era quella di collegarsi ad un dispositivo dispositivo di acquisizione di impronte digitali e gestirlo. Il mio lavoro si è concentrato sulla sostituzione/rimozione di tutte le chiamate ad API deprecate che ne impedivano la pubblicazione su Play Store. In seguito ho avuto anche modo di aggiornare anche tutta l’interfaccia secondo i più moderni standard consigliati da Google."
  }
]
